alejandro-colomar/stm32l4-modules/base/src/led.c
/******************************************************************************
 *	Copyright (C) 2018	Colomar Andrés, Alejandro		      *
 *	Copyright (C) 2018	García Pedroche, Francisco Javier	      *
 *	Copyright (C) 2018	Junquera Carrero, Santiago		      *
 *	SPDX-License-Identifier:	LGPL-2.0-only			      *
 ******************************************************************************/

/**
 *	@file		led.c
 *	@author		Colomar Andrés, Alejandro
 *	@author		García Pedroche, Francisco Javier
 *	@author		Junquera Carrero, Santiago
 *	@copyright	LGPL-2.0-only
 *	@date		2018/dec/04
 *	@brief		LED
 */


/******************************************************************************
 ******* headers **************************************************************
 ******************************************************************************/
/* Standard C ----------------------------------------------------------------*/
	#include <stdbool.h>

/* Drivers -------------------------------------------------------------------*/
	#include "stm32l4xx_hal.h"

/* libalx --------------------------------------------------------------------*/
/* STM32L4 modules -----------------------------------------------------------*/
	#include "errors.h"

	#include "led.h"


/******************************************************************************
 ******* macros ***************************************************************
 ******************************************************************************/


/******************************************************************************
 ******* enums ****************************************************************
 ******************************************************************************/


/******************************************************************************
 ******* structs **************************************************************
 ******************************************************************************/


/******************************************************************************
 ******* variables ************************************************************
 ******************************************************************************/
/* Volatile ------------------------------------------------------------------*/
/* Global --------------------------------------------------------------------*/
/* Static --------------------------------------------------------------------*/
static	bool	init_pending	= true;


/******************************************************************************
 ******* static functions (prototypes) ****************************************
 ******************************************************************************/
static	void	led_gpio_init	(void);
static	void	led_gpio_deinit	(void);


/******************************************************************************
 ******* global functions *****************************************************
 ******************************************************************************/
	/**
	 * @brief	Init LED in GPIO_PIN_5
	 */
void	led_init	(void)
{

	if (init_pending) {
		init_pending	= false;
	} else {
		return;
	}

	led_gpio_init();

	led_reset();
}

	/**
	 * @brief	Deinit LED in GPIO_PIN_5
	 */
void	led_deinit	(void)
{

	if (!init_pending) {
		init_pending	= true;
	} else {
		return;
	}

	led_reset();

	led_gpio_deinit();
}

	/**
	 * @brief	LED on
	 */
void	led_set		(void)
{

	if (init_pending) {
		led_init();
	}

	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5, GPIO_PIN_SET);
}

	/**
	 * @brief	LED off
	 */
void	led_reset	(void)
{

	if (init_pending) {
		led_init();
	}

	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5, GPIO_PIN_RESET);
}


/******************************************************************************
 ******* static functions (definitions) ***************************************
 ******************************************************************************/
static	void	led_gpio_init	(void)
{
	GPIO_InitTypeDef	gpio;
	
	__HAL_RCC_GPIOA_CLK_ENABLE();

	gpio.Pin	= GPIO_PIN_5;
	gpio.Mode	= GPIO_MODE_OUTPUT_PP;
	gpio.Pull	= GPIO_NOPULL;
	gpio.Speed	= GPIO_SPEED_FREQ_LOW;
	HAL_GPIO_Init(GPIOA, &gpio);
}

static	void	led_gpio_deinit	(void)
{

	HAL_GPIO_DeInit(GPIOA, GPIO_PIN_5);
}


/******************************************************************************
 ******* end of file **********************************************************
 ******************************************************************************/
